Revit 2026 API

# FabricSheetDistributionOfWiresAtCover Property

---

The distribution of wires that is closest to the cover.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireDistributionDirection DistributionOfWiresAtCover { get; set; }
```
```vb
Public Property DistributionOfWiresAtCover As WireDistributionDirection
	Get
	Set
```
```cpp
public:
property WireDistributionDirection DistributionOfWiresAtCover {
	WireDistributionDirection get ();
	void set (WireDistributionDirection value);
}
```
```fsharp
member DistributionOfWiresAtCover : WireDistributionDirection with get, set
```

#### Property Value

WireDistributionDirection

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |
| InvalidOperationException | When setting this property: This fabric sheet is bent. Method shall be called only for flat fabric sheets. |

This parameter is only relevant for instances of flat fabric sheets. Fabric sheets are created with the Major distribution set at the cover by default.

#### Reference

FabricSheet Class

Autodesk.Revit.DB.Structure Namespace